[
  {
    "title": "California threatens Tesla with 30-day suspension of sales license for deceptive self-driving claims",
    "content": "California threatens Tesla with 30-day suspension of sales license for deceptive self-driving claims. SAN FRANCISCO (AP) — California regulators are threatening to suspend Tesla's license to sell its electric cars in the state early next year unless the automaker stops using deceptive marketing for its Full Self-Driving feature.",
    "author": "Associated Press",
    "imgUrl": "https://biztoc.com/cdn/8bd171d1db1e3c73_s.webp"
  },
  {
    "title": "Google's Waymo Leads Against Tesla in Robotaxi Market Race",
    "content": "Fund manager and prominent tech analyst Gene Munster said Alphabet Inc.'s Waymo is firmly in the lead against rival Tesla Inc. in the U.S. robotaxi market, while noting that the race was still in its early stages, with plenty of time for Tesla to catch up.",
    "author": "Benzinga",
    "imgUrl": "https://biztoc.com/cdn/7d764b8412ed241d_s.webp"
  },
  {
    "title": "California judge rules that Tesla has to rename Autopilot because it's misleading",
    "content": "The California Department of Motor Vehicles ruled Tuesday that Tesla violated state law by marketing its driver assistance features using misleading terms like Autopilot and Full Self-Driving. The company must change the names or face suspension of its vehicle sales license.",
    "author": "Sherwood News",
    "imgUrl": "https://biztoc.com/cdn/96f5d87f445cc230_s.webp"
  },
  {
    "title": "FSD false advertising case: Tesla must stop lying or it can't sell cars, judge rules",
    "content": "A California judge ruled late Tuesday afternoon that Tesla engaged in deceptive marketing in reference to its Full Self-Driving system, and that Tesla's license to sell and produce cars in the state should be revoked for 30 days.",
    "author": "Electrek",
    "imgUrl": "https://biztoc.com/cdn/fe00e7370bb91e5f_s.webp"
  },
  {
    "title": "Purpose Investments Inc. Announces December 2025 Distributions",
    "content": "TORONTO, Dec. 17, 2025 (GLOBE NEWSWIRE) — Purpose Investments Inc. (Purpose) is pleased to announce distributions for the month of December 2025 for its open-end exchange traded funds and closed-end funds (the Funds). The ex-distribution date for all Open-end ETFs will be December 30, 2025.",
    "author": "GlobeNewswire",
    "imgUrl": "https://ml.globenewswire.com/Resource/Download/a28192cb-6294-4424-8c24-646fee2c81cd"
  },
  {
    "title": "Tesla sparks outrage with sudden move impacting thousands of customers",
    "content": "Tesla customers are facing a frustrating situation after the company remotely disabled their Powerwall 2 home battery systems due to fire risks, leaving them without backup power for months while awaiting replacements. The situation also raises questions about Tesla's customer service.",
    "author": "The Cool Down",
    "imgUrl": "https://s.yimg.com/ny/api/res/1.2/K5GZ6X.UyJmyPSLKogIRjQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/33a6342c63a9f55931f7de30a07e8d42"
  },
  {
    "title": "US House passes Republican healthcare bill without subsidy extension",
    "content": "The U.S. House of Representatives passed a Republican healthcare bill on Wednesday that does not extend Affordable Care Act subsidies, which are set to expire at the end of 2025. The bill passed largely along party lines.",
    "author": "Investing.com",
    "imgUrl": "https://biztoc.com/cdn/6a7ac2902dbc5cce_s.webp"
  },
  {
    "title": "Senate confirms Jared Isaacman as NASA chief months after Trump-Musk rift",
    "content": "Jared Isaacman was confirmed as NASA administrator after a 67-30 Senate vote, becoming the agency's 15th leader after political drama between Trump and Musk. The billionaire private astronaut will lead NASA's mission to return humans to the Moon and eventually Mars.",
    "author": "Fox News",
    "imgUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/11/jared-isaacman-nom-nasa.jpg"
  },
  {
    "title": "US crude futures gain on Trump's Venezuela blockade",
    "content": "U.S. crude oil futures rose on Wednesday after President Donald Trump announced a naval blockade of Venezuela's oil exports, potentially removing significant supply from global markets. West Texas Intermediate crude jumped 3.2% to $71.45 per barrel.",
    "author": "Reuters",
    "imgUrl": "https://biztoc.com/cdn/e6cea79f9fb0373e_s.webp"
  },
  {
    "title": "Taiwan Expected to Hold Key Rate as Economy Roars on AI Frenzy",
    "content": "Taiwan's central bank is expected to keep its benchmark interest rate unchanged on Thursday as the island's economy continues to surge on the back of strong demand for artificial intelligence chips and semiconductors.",
    "author": "Bloomberg",
    "imgUrl": "https://biztoc.com/cdn/4e3e683b5e20d89f_s.webp"
  },
  {
    "title": "Trump plans to dismantle major climate research center",
    "content": "President-elect Donald Trump is planning to shut down a major climate research center that has been at the forefront of studying global warming and its impacts. The move is part of a broader effort to roll back climate policies.",
    "author": "Semafor",
    "imgUrl": null
  },
  {
    "title": "Coinbase Announces Entry Into Prediction Markets and Stock Trading",
    "content": "Cryptocurrency exchange Coinbase announced Wednesday it will expand into prediction markets and stock trading, marking a significant diversification of its business beyond digital assets. The company aims to launch these new services in early 2026.",
    "author": "Bloomberg",
    "imgUrl": "https://biztoc.com/cdn/1e3a32ee1cdd7b2c_s.webp"
  },
  {
    "title": "Netwealth to Pay $67 Million Compensation After Fund's Collapse",
    "content": "Australian wealth management platform Netwealth Group has agreed to pay $67 million in compensation to investors who lost money when a fund it administered collapsed in 2024. The settlement is one of the largest of its kind in Australia's financial services sector.",
    "author": "Bloomberg",
    "imgUrl": "https://biztoc.com/cdn/e710c7b67a8e5a17_s.webp"
  },
  {
    "title": "China's Growing Pile of Long-Term Debt to Deepen Pricing Stress",
    "content": "China's rapidly expanding stock of long-term government bonds is set to intensify pricing pressures in the nation's debt market, potentially complicating Beijing's efforts to support economic growth through fiscal stimulus.",
    "author": "Bloomberg",
    "imgUrl": "https://biztoc.com/cdn/058236ff439e7075_s.webp"
  },
  {
    "title": "Apple Unveils Revolutionary Mixed Reality Headset",
    "content": "Apple has unveiled its latest innovation in mixed reality technology, promising to revolutionize how we interact with digital content. The new headset combines cutting-edge display technology with advanced sensors and spatial audio.",
    "author": "TechCrunch",
    "imgUrl": "https://example.com/apple-headset.jpg"
  },
  {
    "title": "Microsoft Azure Announces Major Cloud Infrastructure Expansion",
    "content": "Microsoft has announced a $50 billion investment in expanding its Azure cloud infrastructure over the next three years, with new data centers planned across Asia, Europe, and South America.",
    "author": "The Verge",
    "imgUrl": "https://example.com/microsoft-azure.jpg"
  },
  {
    "title": "Global Stock Markets Rally on Positive Economic Data",
    "content": "Global stock markets surged on Wednesday following better-than-expected economic data from major economies. The S&P 500 rose 2.1%, while European and Asian markets also posted significant gains.",
    "author": "Financial Times",
    "imgUrl": "https://example.com/stock-market.jpg"
  },
  {
    "title": "New Study Reveals Breakthrough in Cancer Treatment",
    "content": "Researchers at Stanford University have announced a breakthrough in cancer treatment using targeted immunotherapy. Early trials show promising results with significantly improved patient outcomes.",
    "author": "Science Daily",
    "imgUrl": "https://example.com/cancer-research.jpg"
  },
  {
    "title": "Electric Vehicle Sales Hit Record High in Europe",
    "content": "Electric vehicle sales in Europe reached an all-time high in November 2025, accounting for 28% of all new car registrations. The surge is driven by improved infrastructure and government incentives.",
    "author": "Automotive News",
    "imgUrl": "https://example.com/ev-sales.jpg"
  },
  {
    "title": "Amazon Launches Drone Delivery Service in 50 New Cities",
    "content": "Amazon has expanded its Prime Air drone delivery service to 50 new cities across the United States, promising package deliveries in under 30 minutes for eligible items weighing up to 5 pounds.",
    "author": "CNBC",
    "imgUrl": "https://example.com/amazon-drone.jpg"
  },
  {
    "title": "Meta Announces New AI-Powered Social Features",
    "content": "Meta has unveiled a suite of AI-powered features for Facebook and Instagram, including smart content recommendations, automated photo editing, and enhanced privacy controls using machine learning.",
    "author": "Engadget",
    "imgUrl": "https://example.com/meta-ai.jpg"
  },
  {
    "title": "FIFA World Cup 2026 Ticket Sales Surpass Expectations",
    "content": "Ticket sales for the 2026 FIFA World Cup, jointly hosted by the United States, Canada, and Mexico, have surpassed initial projections by 40%. Organizers report unprecedented global interest in the tournament.",
    "author": "ESPN",
    "imgUrl": "https://example.com/world-cup.jpg"
  },
  {
    "title": "SpaceX Successfully Launches First Mission to Europa",
    "content": "SpaceX has successfully launched a mission to Jupiter's moon Europa, carrying scientific instruments designed to search for signs of life beneath the moon's icy surface. The spacecraft is expected to reach its destination in 2032.",
    "author": "Space.com",
    "imgUrl": "https://example.com/europa-mission.jpg"
  },
  {
    "title": "New York City Announces Ambitious Climate Action Plan",
    "content": "New York City has unveiled an ambitious climate action plan aiming for carbon neutrality by 2040. The plan includes massive investments in renewable energy, public transportation, and building retrofits.",
    "author": "The New York Times",
    "imgUrl": "https://example.com/nyc-climate.jpg"
  },
  {
    "title": "OpenAI Releases GPT-5 with Advanced Reasoning Capabilities",
    "content": "OpenAI has released GPT-5, the latest iteration of its language model, featuring significantly improved reasoning capabilities, better context understanding, and reduced hallucinations. The model is now available to enterprise customers.",
    "author": "VentureBeat",
    "imgUrl": "https://example.com/gpt5.jpg"
  }
]
